tutorials/thermoFluidSolidInteraction/robinCavity/0/solid/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    interface
    {
        type            tractionPressure;
        value           uniform 0;
    }
    frontAndBack
    {
         type            empty;
    }
    
    bottom
    {
        type            tractionPressure;
        value           uniform 0;
    }
    
    "left|right"
    {
        type            zeroGradient;
        value           uniform 0;
    }
}


// ************************************************************************* //
